In [1]:
import pandas as pd

In [4]:
temp_df=pd.DataFrame({"city":["patna","delhi","mumbai"],
                     "temperature":[21,22,23]})

In [14]:
hum_df=pd.DataFrame({"city":["mumbai","patna","delhi","banglore"],
                    "humidity":[78,79,80,81]})

In [15]:
df=pd.concat([temp_df,hum_df],axis=1)
df

     city  temperature      city  humidity
0   patna         21.0    mumbai        78
1   delhi         22.0     patna        79
2  mumbai         23.0     delhi        80
3     NaN          NaN  banglore        81

In [23]:
df=pd.merge_ordered(temp_df,hum_df,how="outer")
df

       city  temperature  humidity
0  banglore          NaN        81
1     delhi         22.0        80
2    mumbai         23.0        78
3     patna         21.0        79